# ExternalGeometryId Operators

---
The ExternalGeometryId type exposes the following members.
| Name| Description
---|---|---
| Equality(ExternalGeometryId, ExternalGeometryId)| Determines whether two ExternalGeometryIds are the same.
| Inequality(ExternalGeometryId, ExternalGeometryId)| Determines whether two ExternalGeometryIds are different.
Top
#### Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace